{
  "id": "2025-03-16T19-19-from-klientuserviss-keskosenukai-lv-33c4c611",
  "type": "email",
  "subject": "Täname Teid kirja eest",
  "from": {
    "address": "klientuserviss@keskosenukai.lv",
    "name": "KeskoSenukai LV"
  },
  "to": [
    {
      "address": "gregor.eesmaa@ut.ee",
      "name": ""
    }
  ],
  "cc": [],
  "date": "2025-03-16T19:19:00.000Z",
  "bodyHtml": "<head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\"></head>\n<body><p>Tere!</p>\n\n<p>Oleme Teie kirja kätte saanud, loeme selle lähiajal läbi ja vastame ühe kuu jooksul. Teie kirja number on 04748803*</p>\n<p><i>*Pange tähele, et tegemist on automaatteatega, mis kinnitab Teie pöördumise kättesaamist.</i></p>\nLugupidamisega<br>\n<b>Andmekaitseametnik</b><br>\n<b>UAB Kesko Senukai Digital</b><br>\nKareivių t 11B, LT-09109 Vilnius, Lietuva<br>\nRegistrikood 304144008<br>\n<p>Esitatud päringu töötlemise eesmärgil töötleb Teie isikuandmeid vastutav töötleja UAB Kesko Senukai Digital, kes rakendab õigusaktides kehtestatud kohustusi ning järgib Isikuandmete kaitse üldmääruse (EL) 2016/679 ja teiste õigusaktide nõudeid. Isikuandmeid säilitatakse kaks aastat.<br>\nIsikuandmeid võib edastada nii teistele isikutele, kellele neid tuleb edastada õigusaktides sätestatud korras, kui ka kaasatud teenuseosutajatele (andmete volitatud töötlejatele). Teil on õigus pöörduda ülalnimetatud kontaktidel ja paluda, et lubaksime Teil tutvuda enda isikuandmetega, parandaksime neid või piiraksime andmete töötlemist. Kui arvate, et töötleme Teie isikuandmeid ebaseaduslikult, on Teil õigus esitada kaebus Riiklikule andmekaitseinspektsioonile.<br>\n</p><p>Teavet Teie isikuandmete töötlemise kohta leiate <br>\n<a href=\"https://www.k-rauta.ee/kp/privaatsuspoliitika/a\">Privaatsuspoliitikast.</a><br>\n</p><p>Andmetöötlusametnikuga saate ühendust võtta e-posti aadressil dpo@ksdigital.ee.</p>\n<p><i>Selles sõnumis ja selle lisades esitatud teave on ette nähtud vaid adressaadile. Kui olete saanud sõnumi, mis pole mõeldud Teile, palun teavitage meid sellest e-posti dpo@ksdigital.ee teel ja kustutage kiri.</i></p>\n\n<p style=\"color:white;\">ref:!00D3X03IdO3.!500Tb0PdsNF:ref</p></body>",
  "hiddenReasons": [
    "automated-reply"
  ],
  "attachments": []
}