{
  "id": "2025-05-31T13-17-from-info-upload-ee",
  "type": "email",
  "subject": "Re: IKÜM taotlus seoses isikuandmete töötlemisega teenuses upload.ee / GDPR Request Regarding Processing of Personal Data on upload.ee",
  "from": {
    "address": "info@upload.ee",
    "name": "Upload Team"
  },
  "to": [
    {
      "address": "gregoreesmaa1@gmail.com",
      "name": "Gregor Eesmaa"
    }
  ],
  "cc": [],
  "date": "2025-05-31T13:17:03.000Z",
  "bodyHtml": "<div style=\"white-space: pre-wrap\">Tere\n\nNo kui peab veateavituste ähmasemaks tegemisega lehe kasutamise Teie meelest ära rikkuma siis ok, muutsime errori tekstid üldisemaks.\nKüsiks üle, et kas tegelete ka muude saitidega, kus on reaalselt sadade miljonite kasutajate andmed samas stiilis suures ohus (github, facebook, google), või ainult väiksemate Eesti lehtedega? :)\nJa kui suuremate lehtedega ei tegele ega ei ole plaanis tegeleda, siis miks?\n\nUpload.ee Meeskond\n\n&gt; On 31. May 2025, at 15:41, Gregor Eesmaa <gregoreesmaa1@gmail.com> wrote:\n&gt; \n&gt; Lugupeetud upload.ee vastutav andmetöötleja\n&gt; \n&gt; Pöördun, et edastada ametlikult mure isikuandmete kaitse üldmääruse\n&gt; (IKÜM) alusel seoses minu isikuandmete töötlemisega teenuses\n&gt; upload.ee, mida pean ebaseaduslikuks ning mis võib viia nende\n&gt; avaldamiseni selleks volitamata isikutele ilma selge õigusliku\n&gt; aluseta.\n&gt; \n&gt; Manuses on ametlik taotlus, milles teostan oma õigusi IKÜM artiklite\n&gt; 15, 18 ja 21 alusel. Palun selle läbivaatust ja vastavate meetmete\n&gt; võtmist ajaraamis, mis on sätestatud IKÜM artiklis 12(3) (üks kuu\n&gt; taotluse saamisest).\n&gt; \n&gt; Palun teavitage taotluse kättesaamisest.\n&gt; \n&gt; Lugupidamisega\n&gt; Gregor Eesmaa\n&gt; \n&gt; --\n&gt; \n&gt; Dear Data Controller of upload.ee,\n&gt; \n&gt; I am contacting you to formally raise concerns under the General Data\n&gt; Protection Regulation (GDPR) regarding what I believe to be the\n&gt; unlawful processing of my personal data by upload.ee, potentially\n&gt; leading to its disclosure to unauthorised parties without a clear\n&gt; legal basis.\n&gt; \n&gt; Please find attached a formal application exercising my rights under\n&gt; Articles 15, 18, and 21 of the GDPR. I request that you review and act\n&gt; upon it accordingly, within the timeframe established by Article 12(3)\n&gt; of the GDPR (one month from receipt).\n&gt; \n&gt; Please confirm receipt of this request.\n&gt; \n&gt; Kind regards,\n&gt; Gregor Eesmaa\n&gt; <taotlus-request.asice>\n\n</taotlus-request.asice></gregoreesmaa1@gmail.com></div>",
  "hiddenReasons": [],
  "attachments": []
}