{
  "id": "2025-07-11T09-54-from-privaatsus-euronics-ee-5ba3497c",
  "type": "email",
  "subject": "RE: IKÜM taotlus seoses isikuandmete töötlemisega teenuses euronics.ee / GDPR Request Regarding Processing of Personal Data on euronics.ee",
  "from": {
    "address": "privaatsus@euronics.ee",
    "name": "Euronicsi privaatsus"
  },
  "to": [
    {
      "address": "gregoreesmaa1@gmail.com",
      "name": "Gregor Eesmaa"
    }
  ],
  "cc": [],
  "date": "2025-07-11T09:54:01.000Z",
  "bodyHtml": "<head></head><body><div style=\"white-space: pre-wrap\">Lugupeetud Gregor Eesmaa\n\nTäname Teid 24.06.2025 esitatud päringu eest. Edastame siinkohal vastuseid Teie küsimustele.\n\nEsiteks soovime rõhutada, et oleme antud teemal juba varem vastanud ning selgitanud, et olukord, kus kolmandal osapoolel võib olla võimalik tuvastada, kas konkreetne e-posti aadress on registreeritud meie süsteemis, on meile teada ning meie tegeleme sellega.\n\nTeiseks juhime tähelepanu sellele, et meil on juba rakendatud mõned meetmed, mis takistavad masspäringute tegemist. Mõistame, et kirjeldatud olukord võib tekitada õigustatud tähelepanu, kuid meie hinnangul ei kaasne pelgalt teadmisest, et Teie e-posti aadressiga on konto olemas, kohest ja olulist riski teistele isikuandmetele ja nende kaitsele.\n\nOleme selles küsimuses konsulteerinud ka Andmekaitse Inspektsiooniga ning meie seisukohad olukorra lahendamise kiiruse osas kattuvad. Vastutavana töötlejana meil on kohustus likvideerida puudusi võimalikult kiiresti, kuid arvesse peab võtma mõistlikkuse printsiibi.\n\nTeema väärib tõsist tähelepanu, kuid tuleb arvestada, et lõplike lahenduste leidmine ei ole võimalik teostada koheselt. Vaatamata sellele, kiiremas korras rakendame täiendavaid bruteforce’i vastaseid mehhanisme sh peale mitmeid ebaõnnestunud registreerimise katseid vähendame päringute kiirust.\n\nTöötame aktiivselt kasutajakogemuse parandamise nimel, kaasates ka UX meeskonda, ning usume, et olukorrale leitakse püsiv lahendus hilisemalt suve lõpuks, kuna praegu on aktiivne puhkuste periood.\n\nTäname Teid mõistva suhtumise eest.\n\nLugupidamisega\n\nAndrei Fjodorov\nAntista AS\nKliendilahenduste ja kvaliteedijuht\nLaki põik 6\n\n12918 Tallinn\nT +372 640 6400\nwww.euronics.ee</div></body>",
  "hiddenReasons": [],
  "attachments": []
}