{
  "id": "2025-03-24T10-41-from-urmas-talivee-ohtulehtkirjastus-ee",
  "type": "email",
  "subject": "RE: User email address enumeration vulnerability on ohtuleht.ee",
  "from": {
    "address": "urmas.talivee@ohtulehtkirjastus.ee",
    "name": "Urmas Talivee"
  },
  "to": [
    {
      "address": "gregor.eesmaa@ut.ee",
      "name": "Gregor Eesmaa"
    }
  ],
  "cc": [],
  "date": "2025-03-24T10:41:15.000Z",
  "bodyHtml": "<div>Hi Gregor,<br><br>Thank you. I received report already and discussed about it internally. <br><br>With vulnerabilities found our decisions are as follows:<br><br>Recommended solution to use generic error response when e-mail address is already in use or send an email to user, is not customer friendly who are sometimes not very skillful with using an IT and they need proper response for understanding what they are doing wrong. For example, Gmail also responses with message \"Account is taken\" when registering a new account with already registered name. <br><br>To use reCAPTCHA for anti bot is good recommendation, but still the attacker needs to log-in first and then start to dig with different e-mail addresses, which is not very easy to implement.<br><br>I'm not aware if and what kind of protections our user account system provider (Piano Inc.) has, but they are one of the biggest solution providers for publishers around the globe and in Estonia, postimees.ee and delfi.ee are using same system. Feel free to contact to their support address support@piano.io to get more detailed answers. <br><br>Because of using international solution provider, implementing a new functionality as described your report, is not an easy job to do, but we'll discuss about it with our provider.<br><br>Parimat,\nUrmas Talivee<br><br>-----Original Message-----\nFrom: Gregor Eesmaa <gregor.eesmaa@ut.ee> \nSent: Sunday, March 23, 2025 12:39 PM\nTo: Urmas Talivee <urmas.talivee@ohtulehtkirjastus.ee>\nSubject: User email address enumeration vulnerability on ohtuleht.ee<br><br>Hello,<br><br>During our research on user account enumeration flaws on Estonian online services, we found that your website is vulnerable to the exposure of registered user email addresses.<br><br>The vulnerability report is attached.<br><br>We would appreciate it if you could confirm receipt of this email to prevent us from reaching out to you through other channels.<br><br>Best regards,\nGregor Eesmaa\nComputer Science MSc student\nUniversity of Tartu, Institute of Computer Science\n</urmas.talivee@ohtulehtkirjastus.ee></gregor.eesmaa@ut.ee></div>",
  "attachments": [],
  "hiddenReasons": []
}