{
  "id": "2025-07-23T14-00-from-OlybetEstoniaDPO-olybet-com-6f38be6d",
  "type": "email",
  "subject": "RE: IKÜM taotlus seoses isikuandmete töötlemisega teenuses olybet.ee / GDPR Request Regarding Processing of Personal Data on olybet.ee",
  "from": {
    "address": "OlybetEstoniaDPO@olybet.com",
    "name": "Olybet Estonia DPO"
  },
  "to": [
    {
      "address": "gregoreesmaa1@gmail.com",
      "name": "Gregor Eesmaa"
    }
  ],
  "cc": [],
  "date": "2025-07-23T14:00:58.000Z",
  "bodyHtml": "<head></head><body><div style=\"white-space: pre-wrap\">Lugupeetud hr. Gregor Eesmaa\n\nPöördusite 24.06.2025 OB Holding 1 OÜ kui vastutava andmetöötleja poole seoses veebilehega www.olybet.ee. \n\nKäesolevaga vastame Teie taotlustele.\n\nEsiteks teatame, et Teie viidatud turvanõrkused on tänaseks parandatud ning olete teretulnud uut lahendust testima.\n\nTeiseks, olete küsinud eesmärki ning õiguslikku alust, mille alusel töödeldi teie isikuandmeid viisil, mis muudab need haavatavaks kasutajakontode loendamisele selleks volitamata isikutele (s.t. avaldades, kas Teie meiliaadress on teenuses registreeritud). Selgitame, et sellist eesmärki ei ole, kuivõrd puudub meie äriline soov või muu eesmärk, et mistahes e-posti aadressiga kasutajakonto olemasolu veebilehel oleks veebilehe koodi uurides või muul moel arusaadav. Tegemist oli turvanõrkusega veebilehe tehnilises lahenduses, mis tänaseks päevaks on parandatud.\n\nTurvanõrkuse iseloomust tulenevalt ei ole sel meie hinnangul suurt ohtu, mis võiksid oluliselt andmesubjekte mõjutada või negatiivseid tagajärgi kaasa tuua. Varasemalt veebilehelt kättesaadav teave võimaldas infotehnoloogiaalaste eriteadmiste olemasolul oskuslikult tegutsedes järeldada üksnes seda, kas andmesubjektil on viimase 5 aasta sees olnud konkreetse e-postiaadressiga konto OlyBetis, aga mitte seda, kui palju on isik võitnud, kaotanud, sisse- ja väljamakseid teinud, ehk saada teavet isiku varalise seisu kohta või muud tundlikku teavet, mis võiks isiku õiguseid kahjustada. Mainime, et mitte iga e-postiaadress ei ole IKÜM-i artikli 4 lõike 1 mõttes isikuanne, kuigi peab nentima, et e-posti aadress formaadis eesnimiperenimi1@post.ee seda oleks. Rõhutame, et üks Teie poolt välja toodud turvanõrkuste ärakasutamine nõuaks infotehnoloogiaalaseid eriteadmisi, et muuhulgas veebilehe koodis oleva info põhjal järeldusi teha, mis Teie puhul on kindlasti võimalik, kuid keskmise kasutaja jaoks kindlasti mitte.\n\nLisaks meile teadaolevalt ei ole me hetkel aktiivse rünnaku all, mille eesmärgiks oleks koguda teavet selle kohta, kas konkreetse e-posti aadressiga on seotud mõni kasutajakonto.\n\nSeega ei ole võimalik meil vastata teie kahele ülejäänud taotlusele, kuivõrd turvanõrkuse parandamise tõttu on nende lahendamine perspektiivitu. \n\nMis puudutab Teie isikuandmete kustutamist meie süsteemidest, siis juhime tähelepanu, et kuna olete oma konto meie juures registreerinud ning isikusamasuse tuvastanud läbi SmartID, ning nõustunud kasutustingimustega, siis on Teil vastutava töötlejaga kui hasartmängukorraldajaga kliendisuhe. Tulenevalt hasartmänguseaduse § 53 lõikest 3, oleme kohustatud säilitama 5 aastat iga mängija kohta järgnevad andmed:\n\n•\tiga mängija isikusamasuse tuvastamise;\n•\tiga mängija ees- ja perekonnanime, isikukoodi, selle puudumisel sünniaja ning mängukeskkonda sisenemise ja sealt lahkumise kellaaja ja kuupäeva registreerimise;\n•\tarvepidamise iga mängija tehtud panuste, hasartmängukorraldaja kontole panuste tegemiseks tehtud maksete, mängijale tehtud tagasimaksete ja väljamakstud võitude kohta;\n\nNimetatud periood algab igast sisselogimisest olybet.ee kasutajakontole. Pärast nimetatud perioodi Teie kasutajakontol olevad isikuandmed kustutatakse, välja arvatud juhul, kui Teie isikuandmed on vajalikud õigusnõuete koostamiseks, esitamiseks või kaitsmiseks, mis omakorda sõltub õigusvaidluse olemasolust.\nSeega ei ole meil võimalik seadusest tulenevalt Teie isikuandmeid kustutada enne seaduses ettenähtud säilitustähtaja möödumist.\n\nLõpetuseks, täname Teid konstruktiivse kriitika eest, mis on aidanud meil oma veebilehti turvalisemaks muuta ja soovime edu magistritöö kaitsmisel.\n\nKui käesolev vastus Teid ei rahulda, võite esitada kaebuse Andmekaitse Inspektsioonile e-posti kaudu aadressil info@aki.ee või kohapeal aadressil Tatari 39, Tallinn.\n\nLugupidamisega \nOlyBet andmekaitsespetsialist</div></body>",
  "hiddenReasons": [],
  "attachments": []
}