{
  "id": "2025-06-21T19-39-from-gregoreesmaa1-gmail-com-889560e4",
  "type": "email",
  "subject": "Re: Re: IKÜM taotlus seoses isikuandmete töötlemisega teenuses aeromotors.ee / GDPR Request Regarding Processing of Personal Data on aeromotors.ee (nr. 392620)",
  "from": {
    "address": "gregoreesmaa1@gmail.com",
    "name": "Gregor Eesmaa"
  },
  "to": [
    {
      "address": "info@aeromotors.ee",
      "name": "Aero Motors"
    }
  ],
  "cc": [],
  "date": "2025-06-21T19:39:38.000Z",
  "bodyHtml": "<head></head><body><div dir=\"ltr\">Tere!<div><br></div><div>Tänan esimesele taotlusele vastamast.</div><div><br></div><div>Ei nõustu teie hinnanguga, et meiliaadressiga konto olemasolu kinnitamine selleks volitamata isikule on \"vajalik\".&nbsp;</div><div>Minu hinnangul saab sama vajadust, st selget ja arusaadavat tagasisidet edastada ka meili teel, mis tagaks nendele andmetele ligipääsu vaid meilikasti nägevale isikule (välistades selleks volitamata isikud).&nbsp;</div>&nbsp; &nbsp; - Näiteks registreerimisvorm võiks pärast meiliaadressi sisestamist saata ühe kahest meilist, kas \"klõpsa siin et kasutaja loomisega jätkata\" või \"kasutaja on juba olemas – klõpsa siin, et parool lähtestada\".&nbsp;<div>&nbsp; &nbsp; - Sarnased lahendused on võimalikud ka teistele mõjutatud vormidele. Need on täpsustatud eelnevalt lisatud aruandes.<br><div>Tuletan ka meelde, et IKÜM&nbsp;artikli 5 järgi peate töötlemisel tagama, et isikuandmed oleks \"õiged\", mistõttu ei saa lisasammu meiliaadressi kinnitamiseks lugeda liigseks/ebavajalikuks.</div><div><br></div><div>Lisaks, möödarääkimise vältimiseks palun kinnitage, et keeldute kolmandat taotlust täitmast – st ei arvesta minu IKÜM artikli 21 kohase vastuväitega minu isikuandmete sellisele töötlemisele, ega minu hinnanguga, et selles kontekstis kaaluvad teie huvi üles minu huvid, põhiõigused- ja vabadused isikuandmete kaitsele ja privaatsusele.&nbsp;</div><div>Vastasel juhul palun kinnitage sammud, mida selle taotluse täitmiseks võtate.</div><div><br></div><div>Kõike paremat</div><div>Gregor Eesmaa</div><div><br></div><div>--</div><div><br></div><div>Hello!</div><div><br></div><div>Thank you for responding to the first request.</div><div><br></div><div>I do not agree with your assessment, that confirming an account exists with a given email address to an unauthorised party is \"necessary\".</div><div>In my view, the same necessity, giving clear and plain feedback, can also be done over email, which would ensure this data is accessible only to a party with access to the email inbox (excluding unauthorised parties).</div><div>&nbsp; &nbsp; - For example, the registration form could send one of two emails after the email has been input, either \"click here to continue registration\" or \"account already exists – click here to reset password\".</div><div>&nbsp; &nbsp; - Similar resolutions are possible for other affected forms. These are detailed in the previously&nbsp;attached report.</div><div>I also remind you, that according to GDPR Article 5, you shall ensure personal data is \"accurate\", so the additional step of verifying the email can not be assumed to be excessive/unnecessary.</div><div><br></div><div>Also, to avoid miscommunication, please confirm that you refuse to fulfill the third request – that is, you will not consider my objection to such processing, as per GDPR article 21; nor the assessment that my interests, fundamental rights and freedoms to data protection and privacy override your interests in this context.</div><div>Otherwise, please confirm the steps you'll take to fulfill this request.</div><div><br></div><div>Best regards</div><div>Gregor Eesmaa</div><div><br></div></div></div><br>\n</body>",
  "hiddenReasons": [],
  "attachments": []
}