{
  "id": "2025-05-31T21-53-from-gregoreesmaa1-gmail-com",
  "type": "email",
  "subject": "Re: [ABOUT YOU] Re: IKÜM taotlus seoses isikuandmete töötlemisega teenuses aboutyou.ee / GDPR Request Regarding Processing of Personal Data on aboutyou.ee (Klienditeenindus 19660706)",
  "from": {
    "address": "gregoreesmaa1@gmail.com",
    "name": "Gregor Eesmaa"
  },
  "to": [
    {
      "address": "klienditeenindus@aboutyou.ee",
      "name": "ABOUT YOU"
    }
  ],
  "cc": [],
  "date": "2025-05-31T21:53:26.000Z",
  "bodyHtml": "<head></head><body><div dir=\"ltr\">Tere!<br><br>Esitasin teile kolm ametlikku taotlust, kuid ei saanud kokkuvõtlikku, selget ega arusaadavat vastust ühelegi. Palun vaadake oma vastus üle.<br><br>Lisaks, link, millele viitate annab viga: \"Uh oh - 404\", \"Sorry, this page no longer exists.\"<br><br>Tuletan meelde, et vastavalt IKÜM artiklile 12 peate vastama \"kokkuvõtlikult, selgelt, arusaadavalt ning lihtsasti kättesaadavas vormis\". Teie vastus ei tundu neid nõudeid täitma.<br>Lisaks, vastavalt IKÜM artiklile 5 peab isikuandmete töötlemisel tagama, et töötlemine oleks andmesubjektile (minule) läbipaistev ning samuti peate olema võimeline töötlemise seaduslikkust ja turvalisust tõendama. Minu andmete töötlemine taotluses kirjeldatud moel ei ole minule läbipaistev, ning sellise töötlemise seaduslikkus ja turvalisus ei ole tõendatud.<br><br>Lugupidamisega<br>Gregor Eesmaa<br><br>--<br><br>Hello!<br><br>I had raised three formal requests, but did not receive a concise, transparent nor intelligible reply to any of them. Please revise your reply.<br><br>Additionally, the link you provided shows an error: \"Uh oh - 404\", \"Sorry, this page no longer exists.\"<br><br>I remind you, that according to GDPR Article 12 you must reply \"in a concise, transparent, intelligible and easily accessible form\". Your reply does not seem to fulfill these requirements.<br>Additionally, according to GDPR Article 5, personal data must be processed in a transparent manner in relation to the data subject (me) and you must also be able to demonstrate lawfulness and security of the processing. Processing of my data in the manner described in the request is not transparent to me, nor are lawfulness and security of such processing demonstrated.<br><br>Kind regards,<br>Gregor Eesmaa</div><br>\n</body>",
  "hiddenReasons": [],
  "attachments": []
}