{
  "id": "2025-07-23T10-52-from-gregoreesmaa1-gmail-com-318aec4d",
  "type": "email",
  "subject": "Re: [ABOUT YOU] Re: RE: IKÜM taotlus seoses isikuandmete töötlemisega teenuses aboutyou.ee / GDPR Request Regarding Processing of Personal Data on aboutyou.ee (Klienditeenindus 19778553)",
  "from": {
    "address": "gregoreesmaa1@gmail.com",
    "name": "Gregor Eesmaa"
  },
  "to": [
    {
      "address": "klienditeenindus@aboutyou.ee",
      "name": "ABOUT YOU"
    }
  ],
  "cc": [],
  "date": "2025-07-23T10:52:26.000Z",
  "bodyHtml": "<head></head><body><div dir=\"ltr\"><div dir=\"ltr\">Hello!<div><br></div><div>Thank you for your response, which I have received and reviewed.<br><br>I am writing to address several points in your letter and to formally reiterate my requests under the EU General Data Protection Regulation (GDPR).</div><div><br></div><div><b>First, I must correct a fundamental misunderstanding.</b>&nbsp;My requests were made in my capacity as a private individual and data subject, as I explicitly stated: \"I am writing to you as a data subject...\". I am not acting on behalf of the University of Tartu. The vulnerability report I authored as a student was provided solely as supporting evidence to clearly demonstrate the specific personal data processing that I am contesting. The motivation behind both the GDPR requests and my thesis work is the singular personal interest to enjoy a higher degree of privacy in services provided to Estonians.</div><div><br></div><div><b>I am not satisfied with your cited basis of Article 6(1)(b)</b> \"processing is necessary for the performance of a contract to which the data subject is party or in order to take steps at the request of the data subject prior to entering into a contract\". If the contract can be fulfilled without the processing, it is not \"necessary\". As demonstrated by numerous other e-commerce sites (e.g. <a href=\"http://soov.ee\" target=\"_blank\">soov.ee</a> and <a href=\"http://kuldnebors.ee\" target=\"_blank\">kuldnebors.ee</a>), it is entirely possible to provide password reset, registration, and email change functionalities without exposing whether an email address is registered. Since less intrusive, privacy-preserving alternatives exist, the current method cannot be considered \"necessary\" under Article 6(1)(b).</div><div><br></div><div><b>I accept your cited basis of Article 6(1)(f)</b> \"processing is necessary for the purposes of the legitimate interests pursued by the controller or by a third party, except where such interests are overridden by the interests or fundamental rights and freedoms of the data subject which require protection of personal data, in particular where the data subject is a child\". You have well explained that user-friendliness is a strong reason why you would prefer not to change your current behaviour. However, your argument here is not very strong:</div><div>1. The claim is relevant only to the password reset form, not the account registration form or email change form; because only the former can possibly distinguish a user mistake. The latter two have no way of possibly understanding if the user has provided an invalid email address.</div><div>2. Despite arguing for user-experience being better as-is, you also argued the opposite: \"<i>The information \"Uh oh, something went wrong\" does not give any information to someone who does not have an account and it can thus not be construed what this means, i.e. whether there is no</i></div><i>account, there is a typing error, etc</i>\". So I understand you also agree the current messaging is not very user-friendly.<div>3. It is possible to revise the mitigation strategy of the password reset form to account for this:&nbsp;send an email and vary its contents (similar to suggestions of mitigation on registration form). In that case, you could show the message: \"Further instructions have been sent to your email. If you did not receive them, please verify the email is correct\".</div><div><br></div><div><b>It is also important to highlight that&nbsp;the vulnerable behaviour does not exist in isolation:&nbsp;</b>Despite your claim about a generic \"something went wrong\" not having any specific meaning, a possible attacker needn't understand a single message in isolation. The responses can be compared with a known email address, establishing account existence.</div><div><br></div><div>Similarly, while your claim that there is \"not much risk\" due to this vulnerability may be correct when considering your service in isolation, a possible attacker could profile a single person across multiple services, enabling user profiling. That is a serious privacy risk.</div><div><br></div><div><b>I therefore formally reiterate my remaining requests:</b></div><div><div>- <b>Pursuant to Article 18 of GDPR</b>, I request the restriction of my personal data being processed in a manner vulnerable to account enumeration (i.e., revealing whether my email address is registered within the service). I contest the lawfulness of this specific processing. I also oppose erasure of my personal data.&nbsp;</div><div>- <b>Pursuant to Article 21 of GDPR</b>, I object to any processing of my personal data for the purpose of revealing account existence to any unauthorised party, particularly where such processing might be claimed under legitimate interests. My interests, fundamental rights and freedoms to data protection and privacy override such interests in this context.</div><div><br></div><div>Best wishes</div><font color=\"#888888\"><div>Gregor Eesmaa</div></font></div></div><br>\n</div>\n</body>",
  "hiddenReasons": [],
  "attachments": []
}