{
  "id": "2025-06-26T07-32-from-klienditugi-okidoki-ee",
  "type": "email",
  "subject": "IKÜM taotlus seoses isikuandmete töötlemisega teenuses okidoki.ee / GDPR Request Regarding Processing of Personal Data on okidoki.ee",
  "from": {
    "address": "klienditugi@okidoki.ee",
    "name": "Jana Lipponen"
  },
  "to": [
    {
      "address": "gregoreesmaa1@gmail.com",
      "name": ""
    }
  ],
  "cc": [],
  "date": "2025-06-26T07:32:20.000Z",
  "bodyHtml": "<head></head><body><div style=\"max-width: 600px; line-height: 18px; font-family: Arial, Helvetica, sans-serif; font-size: 14px; color:#000000;\" id=\"staff_response\">\n        <p>\n                    Tere,<br>\n<br>\nTäname ootamast.<br>\n<br>\nLugupeetud Gregor Eesmaa,<br>\n<br>\nOleme tutvunud  Teie 17.03.2025. aasta haavatavuste aruandes esitatud järeldustega, ning täname Teid nende teemade meie tähelepanu alla toomise eest. Meie platvormi kasutajate turvalisuse, privaatsuse ja usalduse tagamine on jätkuvalt meie kõrgeim prioriteet ning hindame Teie põhjalikkust nende probleemide esiletoomisel.<br>\n<br>\nMõistame Teie muret, seoses isikuandmete (nt e-posti aadressi) kasutajakontode loendamise rünnakute võimalikkusega. Kõik turvariskid hinnatakse ja kaardistatakse nende tõsiduse põhjal ning rakendatakse sobivaid tehnilisi ja organisatsioonilisi meetmeid, et tagada riskile vastav turvatase.<br>\n<br>\nTe viitasite oma aruandes järgmistele vormidele:<br>\n<br>\n1. parooli lähtestamise vorm<br>\n2. kasutaja registreerimise vorm<br>\n3. e-posti aadressi muutmise vorm<br>\n<br>\nEespool nimetatud punktide hindamise järel oleme koostanud järgmise tööplaani. Punktid 1 ja 3 on suhteliselt lihtsad lahendada ning need on kavas lõpetada juulis 2025. Punkt 2 nõuab aga registreerimisvoo märkimisväärset ümberkujundamist ja mõjutab mitmeid süsteemidevahelisi sõltuvusi. Meeskonna hinnangul võtab see töö aega kolm kuni kuus kuud ning oleme planeerinud selle 2025. aasta neljandasse kvartalisse. Tunnistades tuvastatud riski, rakendame 2025. aasta juulis registreerimisvormile ka ajutise kontrolli – kohandame oma pettustevastast süsteemi nii, et pärast mitut e-posti sisestamist lisatakse päringu teinud IP-aadress halli nimekirja ja kasutajale kuvatakse registreerimisel CAPTCHA. See ei ole lõplik lahendus, kuid takistab oluliselt pahatahtlikul isikul masskontrollide läbiviimist.<br>\n<br>\nUsume, et see plaan käsitleb Teie muresid ning kinnitab meie pühendumust kasutajate turvalisuse ja privaatsuse kaitsele.<br>\n<br>\nArvestame Teie uurimistöös pakutud alternatiivseid sõnastusi, ent ei saa garanteerida, et iga ettepanek ka rakendatakse. Näiteks peame hindama soovimatute e-kirjade saatmisega seotud võimalikke juriidilisi tagajärgi (soovitus peatükis 2.3).<br>\n<br>\nTehniliste meetmete kõrval oleme tugevdanud ka privaatsuse juhtimist. Isikuandmete kaitse üldmäärus (IKÜM) annab andmesubjektidele laia valiku õigusi. Täieliku vastavuse tagamiseks ja nende õiguste selgemaks selgitamiseks uuendasime hiljuti oma privaatsusteatist. Tehniline meeskond viimistleb praegu samme teatise avaldamiseks meie veebisaidil ning see saab peagi kättesaadavaks.<br>\n<br>\nAlljärgnevalt vastame Teie taotluses esitatud küsimustele.<br>\n<br>\n     1. IKÜM art 15 taotlus<br>\n<br>\nVastuseks Teie taotlusele, milles palusite viidata “IKÜM artikli 6 järgi kehtivale õiguslikule alusele, mille alusel töötlete minu (eelnevalt kirjeldatud) andmeid viisil, mis muudab need haavatavaks kasutajakontode loendamisele selleks volitamata isikutele”, selgitame järgmist.<br>\n<br>\nKonto loomisel palume kasutajatel esitada andmed Okidoki kasutajakonto loomiseks ja haldamiseks. Selle töötlemise õiguslik alus on lepingu täitmine (IKÜM art 6 lg 1 p b). Kuigi meie privaatsusteatises ei ole eraldi märgitud teavitusi selle kohta, kas e-posti aadress on juba kasutusel, kuulub see tegevus ikkagi eesmärgi „Okidoki kasutajakonto loomine ja haldamine“ alla. Sõnumite kuvamine kasutajatele, kes kasutavad parooli lähtestamise vormi, kasutaja registreerimise vormi või e-posti aadressi muutmise vormi, on osa laiemast konto taastamise teenusest, mida pakume kasutajatele põhilise teenuse osana. Kuigi sõnumi konkreetne sõnastus võib suurendada kasutajakontode loendamise ründe riski, ei tähenda see, et meil puuduks kehtiv õiguslik alus konto taastamise teenuse osutamiseks.<br>\n<br>\n     2. IKÜM art 18 ja 21 taotlus<br>\n<br>\nVastuväide, mida saab esitada IKÜM-i artikli 21 lõike 1 alusel, on piiratud andmetöötlusega, mis tugineb IKÜM-i artikli 6 lõike 1 punktidele e või f. Kuna kasutajakonto taastamise teenuse pakkumise õiguslik alus on IKÜM-i artikli 6 lõike 1 punkt b, puudub Teil õigus esitada selle andmetöötluse osas vastuväidet.<br>\n<br>\nOlete taotlenud ka oma isikuandmete töötlemise piiramist viisil, mis on haavatav kontode tuvastamise (account enumeration) suhtes, ning väitnud, et vaidlustate selle konkreetse töötlemise seaduslikkuse. Kuna Te ei ole täpsustanud, millisele sättele Teie taotlus tugineb, tõlgendame seda IKÜM-i artikli 18 lõike 1 punktide b ja d alusel esitatuna.<br>\n<br>\nKuna kirjeldatud andmetöötlus tugineb IKÜM-i artikli 6 lõike 1 punktile b, ei ole Teil õigust taotleda töötlemise piiramist IKÜM-i artikli 18 lõike 1 punkt d alusel.<br>\n<br>\nMis puudutab õigust piirata töötlemist IKÜM-i artikli 18 lõike 1 punkt b alusel, on andmetöötlus ebaseaduslik vaid juhul, kui IKÜM-i artikli 6 lõike 1 kohased õiguslikud alused ei kohaldu või enam ei kohaldu. See hõlmab olukordi, kus konkreetne seadus, regulatsioon või haldusakt kuulutab töötlemise ebaseaduslikuks. Kuna konto taastamise teenus põhineb kehtival õiguslikul alusel, puudub Teil õigus taotleda selle andmetöötluse piiramist IKÜM-i artikli 18 lõike 1 punkt b alusel.<br>\n<br>\nNeil põhjustel ei saa me seda konkreetset töötlemist piirata.<br>\n<br>\nSellegipoolest soovime veelkord avaldada siirast tunnustust Teie väärtusliku panuse eest meie platvormi turvalisuse tugevdamisse.<br>\n<br>\nLugupidamisega,<br>\nokidoki\n                                    \n            </p>\n    \n    \n    \n</div>\n  <img src=\"https://help.okidoki.com/tp_message/lCHJLGZHCB+wonl32TODKMqKwXaOCQMcY0gjVQ==\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" style=\"height:1px !important;width:1px !important;border-width:0 !important;margin-top:0 !important;margin-bottom:0 !important;margin-right:0 !important;margin-left:0 !important;padding-top:0 !important;padding-bottom:0 !important;padding-right:0 !important;padding-left:0 !important;\">\n\n\n</body>",
  "hiddenReasons": [],
  "attachments": []
}